# 'brew tap'
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"


# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications"


# 'brew install'
brew "awscli"
brew "bat"
brew "coreutils"
brew "exa"
brew "fish"
brew "ghq"
brew "git"
brew "git-lfs"
brew "jq"
brew "mas"
brew "nvm"
brew "sk"
brew "starship"
brew "tig"
brew "wget"


# 'brew install --cask'
cask "adobe-creative-cloud"
cask "adoptopenjdk8"
cask "alt-tab"
cask "appcleaner"
cask "brave-browser"
cask "cheatsheet"
cask "clipy"
cask "coteditor"
cask "dropzone"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "imageoptim"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "mi"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "skim"
cask "skitch"
cask "slack"
cask "spectacle"
cask "the-unarchiver"
cask "todoist"
cask "visual-studio-code"
cask "vivaldi"
cask "zxpinstaller"


# 'mas install'
mas "Drafts", id: 1435957248
mas "RunCat", id: 1429033973
